{
    "pluginmetadataversion": 2,
    "name": "LR35902 Architecture & GameBoy ROM view",
    "type": [
        "architecture",
        "binaryview"
    ],
    "api": [
        "python3"
    ],
    "description": "LR35902 architecture ",
    "longdescription": "<p>\nThis LR35902 architecture plugin was written after a grueling CTF challenge of a GB ROM to have a building block for future challenges. None of the other plugins provided LLIL lifting at the time, so this aims to change that.\n</p>\n<p>\nThis plugin uses the <a href='https://github.com/Lukas-Dresel/lr35902dis'>lr35902</a> library for disassembly, and was rather unceremoniously ripped straight from Vector 35's <a href='https://github.com/Vector35/Z80'>Z80</a> plugin and modified to support the opcodes of the LR35902 CPU. It also contains a GameBoyRomView straight up stolen from <a href='https://github.com/ZetaTwo/binja-gameboy'>ZetaTwo's Improved GameBoyRom plugin</a>.</p>\n<p>The aim is to be able to lift the entire LR35902 instruction set to LLIL accurately. If you find any instructions lifted incorrectly, please create an Issue or a Pull Request.</p>",
    "license": {
        "name": "MIT",
        "text": "Copyright (c) 2022 Lukas Dresel\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
    },
    "platforms": [
        "Windows",
        "Linux",
        "Darwin"
    ],
    "installinstructions": {
        "Windows": "The built-in Python 2.7 currently included in Windows builds can't easily have additional dependencies installed. We recommend installing a 64-bit version of python, using the native pip functionality to install the lr35902dis module.",
        "Linux": "pip install lr35902dis; pip3 install lr35902dis",
        "Darwin": "pip install lr35902dis; pip3 install lr35902dis"
    },
    "dependencies": {
        "pip": [
            "lr35902dis"
        ]
    },
    "version": "1.0",
    "author": "Lukas Dresel",
    "minimumbinaryninjaversion": 776
}